chaosloth/ESP32_ArtNetNode/libs/espArtnetRDM/espArtNetRDM.cpp
  for (int x = 213; x < ARTNET_REPLY_SIZE; x++)
    _artReplyBuffer[x] = 0;             // Reserved for future - transmit 0


  // Set values for each group of ports and send artPollReply
  for (uint8_t groupNum = 0; groupNum < _art->numGroups; groupNum++) {
    group_def* group = _art->group[groupNum];
    
    if (group->numPorts == 0)
      continue;

    _artReplyBuffer[18] = group->netSwitch;       // net
    _artReplyBuffer[19] = group->subnet;          // subnet
    _artReplyBuffer[173] = group->numPorts;       //number of ports (Lo byte)

    _artReplyBuffer[211] = groupNum+1;    	  // Bind Index

    // Port details
    for (int x = 0; x < 4; x++) {

      // Send blank values for empty ports
      _artReplyBuffer[174 + x] = 0;
      _artReplyBuffer[178 + x] = 0;
      _artReplyBuffer[182 + x] = 0;
      _artReplyBuffer[186 + x] = 0;
      _artReplyBuffer[190 + x] = 0;

      // This port isn't in use
      if (group->ports[x] == 0)
        continue;

      // DMX or RDM out port
      if (group->ports[x]->portType != DMX_IN) {

        // Get values for Good Output field
        byte go = 0;
        if (group->ports[x]->dmxChans != 0)
          go |= 128;						// data being transmitted
        if (group->ports[x]->merging)
          go |= 8;						// artnet data being merged
        if (! group->ports[x]->mergeHTP)
          go |= 2;						// Merge mode LTP
        if (group->ports[x]->e131)
          go |= 1;						// sACN
        
        _artReplyBuffer[174 + x] |= 128;			//Port Type (128 = DMX out)
        _artReplyBuffer[182 + x] = go;				//Good output (128 = data being transmitted)
        _artReplyBuffer[190 + x] = group->ports[x]->portUni;  	// swOut - port address

      // DMX In port info
      } else if (group->ports[x]->portType == DMX_IN) {
        _artReplyBuffer[174 + x] |= 64;				// Port type (64 = DMX in)

        if (group->ports[x]->dmxChans != 0)
          _artReplyBuffer[178 + x] = 128;       		// Good input (128 = data being received)

        _artReplyBuffer[186] = group->ports[0]->portUni;  	// swIn

      }
    }

    // Send packet
    eUDP.beginPacket(_art->broadcastIP, ARTNET_PORT);
    eUDP.write(
#ifdef ESP32
  	  (const uint8_t *)
#endif  // #ifdef ESP32
      _artReplyBuffer,ARTNET_REPLY_SIZE);
    eUDP.endPacket();

    delay(0);
  }
}


void esp8266ArtNetRDM::artPollReply() {
  if (_art == 0)
    return;

  _artPoll();
}

void esp8266ArtNetRDM::_artDMX(unsigned char *_artBuffer) {
  group_def* group = 0;

  IPAddress rIP = eUDP.remoteIP();

  uint8_t net = (_artBuffer[15] & 0x7F);
  uint8_t sub = (_artBuffer[14] >> 4);
  uint8_t uni = (_artBuffer[14] & 0x0F);

  // Number of channels hi byte first
  uint16_t numberOfChannels = _artBuffer[17] + (_artBuffer[16] << 8);
  uint16_t startChannel = 0;

  // Loop through all groups
  for (int x = 0; x < _art->numGroups; x++) {
    if (net == _art->group[x]->netSwitch && sub == _art->group[x]->subnet) {
      group = _art->group[x];

      // Loop through each port
      for (int y = 0; y < 4; y++) {
        if (group->ports[y] == 0 || group->ports[y]->portType == DMX_IN)
          continue;
        
        // If this port has the correct Net, Sub & Uni then save DMX to buffer
        if (uni == group->ports[y]->portUni)
          _saveDMX(&_artBuffer[ARTNET_ADDRESS_OFFSET], numberOfChannels, x, y, rIP, startChannel);
      }
    }
  }
}

void esp8266ArtNetRDM::_saveDMX(unsigned char *dmxData, uint16_t numberOfChannels, uint8_t groupNum, uint8_t portNum, IPAddress rIP, uint16_t startChannel) {
  group_def* group = _art->group[groupNum];
  port_def* port = group->ports[portNum];

  uint8_t senderID = 255;  // Will be set to 0 or 1 if valid later

  unsigned long timeNow = millis();

  // We can't do the next calculations until after 10 seconds
  if (timeNow > 10000) {
    unsigned long timeExp = timeNow - 10000;

    // Clear IPs that we haven't heard from in over 10 seconds
    if (port->lastPacketTime[0] < timeExp)
      port->senderIP[0] = INADDR_NONE;
    else if (port->lastPacketTime[1] < timeExp)
      port->senderIP[1] = INADDR_NONE;
  }

  // Get a sender ID
  if (port->senderIP[0] == rIP) {
    senderID = 0;
    port->lastPacketTime[0] = timeNow;
  } else if (port->senderIP[1] == rIP || port->senderIP[1] == INADDR_NONE) {
    senderID = 1;
    port->senderIP[1] = rIP;
    port->lastPacketTime[1] = timeNow;
  } else if (port->senderIP[0] == INADDR_NONE) {
    senderID = 0;
    port->senderIP[0] = rIP;
    port->lastPacketTime[0] = timeNow;
  }

  // This is a third IP so drop the packet (Artnet v4 only allows for merging 2 DMX streams)
  if (senderID == 255)
    return;
  
  // Check if we're merging (the other IP will be non zero)
  if (port->senderIP[(senderID ^ 0x01)] == INADDR_NONE)
    port->merging = false;
  else
    port->merging = true;
  

  // Cancel merge is old so cancel the cancel merge
  if ((group->cancelMergeTime + ARTNET_CANCEL_MERGE_TIMEOUT) < millis()) {
    group->cancelMerge = false;
    group->cancelMergeIP = INADDR_NONE;
  
  } else {
    // This is the correct IP, enable cancel merge
    if (group->cancelMergeIP == port->senderIP[senderID]) {
      group->cancelMerge = 1;
      group->cancelMergeTime = millis();
      port->mergeHTP = false;
      port->merging = false;
      
    // If the merge is current & IP isn't correct, ignore this packet
    } else if (group->cancelMerge)
      return;
  }
  
  // Store number of channels
  if (numberOfChannels > port->dmxChans)
    port->dmxChans = numberOfChannels;

  // Check if we should merge (HTP) or not merge (LTP)
  if (port->merging && port->mergeHTP) {
    // Check if there is a buffer.  If not, allocate and clear it
    if (port->ipBuffer == 0) {
      
      port->ipBuffer = (byte*) os_malloc(2 * DMX_BUFFER_SIZE);
      delay(0);
      _artClearDMXBuffer(port->ipBuffer);
      _artClearDMXBuffer(&port->ipBuffer[DMX_BUFFER_SIZE]);
      delay(0);
    }

    // Put data into our buffer
    memcpy(&port->ipBuffer[senderID * DMX_BUFFER_SIZE + startChannel], dmxData, numberOfChannels);
    
    // Get the number of channels to compare
    numberOfChannels = (port->dmxChans > numberOfChannels) ? port->dmxChans : numberOfChannels;
    
    // Compare data and put in the output buffer
    for (uint16_t x = 0; x < numberOfChannels; x++)
      port->dmxBuffer[x] = (port->ipBuffer[x] > port->ipBuffer[x + DMX_BUFFER_SIZE]) ? port->ipBuffer[x] : port->ipBuffer[x + DMX_BUFFER_SIZE];

    // Call our dmx callback in the main script (Sync doesn't get used when merging)
    _art->dmxCallBack(groupNum, portNum, numberOfChannels, false);
    
  } else {
    // Copy data directly into output buffer
    memcpy(&port->dmxBuffer[startChannel], dmxData, numberOfChannels);
    
