chaosloth/ESP32_ArtNetNode/libs/espArtnetRDM/espArtNetRDM.cpp
          bool ipSet = false;

          for (int q = 0; q < 5; q++) {
            // Check when last packets where received.  Clear if over 200ms
            if (timeNow >= (group->ports[y]->rdmSenderTime[q] + 200))
              group->ports[y]->rdmSenderIP[q] = INADDR_NONE;
        
            // Save our IP
            if (!ipSet) {
              if (group->ports[y]->rdmSenderIP[q] == INADDR_NONE || group->ports[y]->rdmSenderIP[q] == remoteIp) {
                group->ports[y]->rdmSenderIP[q] = remoteIp;
                group->ports[y]->rdmSenderTime[q] = timeNow;
                ipSet = true;
              }
            }
          }
        }
      }
    }
  }
}

void esp8266ArtNetRDM::rdmResponse(rdm_data* c, uint8_t g, uint8_t p) {
  if (_art == 0)
    return;

  uint16_t len = ARTNET_RDM_REPLY_SIZE + c->packet.Length + 1;
  // Initialise our reply
  char rdmReply[len];
  
  rdmReply[0] = 'A';
  rdmReply[1] = 'r';
  rdmReply[2] = 't';
  rdmReply[3] = '-';
  rdmReply[4] = 'N';
  rdmReply[5] = 'e';
  rdmReply[6] = 't';
  rdmReply[7] = 0;
  rdmReply[8] = ARTNET_RDM;          // op code lo-hi
  rdmReply[9] = ARTNET_RDM >> 8;
  rdmReply[10] = 0;
  rdmReply[11] = 14;                 // artNet version (14)
  rdmReply[12] = 0x01;               // RDM version - RDM STANDARD V1.0

  for (uint8_t x = 13; x < 21; x++)
    rdmReply[x] = 0;

  rdmReply[21] = _art->group[g]->netSwitch;
  rdmReply[22] = 0x00;              // Command - 0x00 = Process RDM Packet
  rdmReply[23] = (_art->group[g]->subnet << 4) | _art->group[g]->ports[p]->portUni;

  // Copy everything except the 0xCC start code
  memcpy(&rdmReply[24], &c->buffer[1], c->packet.Length + 1);

  for (int x = 0; x < 5; x++) {
    if (_art->group[g]->ports[p]->rdmSenderIP[x] != INADDR_NONE) {
      // Send packet
      eUDP.beginPacket(_art->group[g]->ports[p]->rdmSenderIP[x], ARTNET_PORT);
      int test = eUDP.write(
#ifdef ESP32
	    (const uint8_t *)
#endif  // #ifdef ESP32
        rdmReply,len);
      eUDP.endPacket();
    }
  }
}

void esp8266ArtNetRDM::_artRDMSub(unsigned char *_artBuffer) {
  //Serial.println("artRDMSub");
}

IPAddress esp8266ArtNetRDM::getIP() {
  if (_art == 0)
    return INADDR_NONE;
  return _art->deviceIP;
}

IPAddress esp8266ArtNetRDM::getSubnetMask() {
  if (_art == 0)
    return INADDR_NONE;
  return _art->subnet;
}

bool esp8266ArtNetRDM::getDHCP() {
  if (_art == 0)
    return 0;
  return _art->dhcp;
}


void esp8266ArtNetRDM::setIP(IPAddress ip, IPAddress subnet) {
  if (_art == 0)
    return;
  _art->deviceIP = ip;
  
  if ( (uint32_t)subnet != 0 )
    _art->subnet = subnet;
  
  _art->broadcastIP = IPAddress((uint32_t)_art->deviceIP | ~((uint32_t)_art->subnet));
}

void esp8266ArtNetRDM::setDHCP(bool d) {
  if (_art == 0)
    return;
  _art->dhcp = d;
}

void esp8266ArtNetRDM::setNet(uint8_t g, uint8_t net) {
  if (_art == 0 || g >= _art->numGroups)
    return;
  _art->group[g]->netSwitch = net;
}

uint8_t esp8266ArtNetRDM:: getNet(uint8_t g) {
  if (_art == 0 || g >= _art->numGroups)
    return 0;
  return _art->group[g]->netSwitch;
}

void esp8266ArtNetRDM::setSubNet(uint8_t g, uint8_t sub) {
  if (_art == 0 || g >= _art->numGroups)
    return;
  _art->group[g]->subnet = sub;
}

byte esp8266ArtNetRDM::getSubNet(uint8_t g) {
  if (_art == 0 || g >= _art->numGroups)
    return 0;
  return _art->group[g]->subnet;
}

void esp8266ArtNetRDM::setUni(uint8_t g, uint8_t p, uint8_t uni) {
  if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
    return;
  _art->group[g]->ports[p]->portUni = uni;
}

byte esp8266ArtNetRDM::getUni(uint8_t g, uint8_t p) {
  if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
    return 0;
  return _art->group[g]->ports[p]->portUni;
}


void esp8266ArtNetRDM:: setPortType(uint8_t g, uint8_t p, uint8_t t) {
  if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
    return;

  _art->group[g]->ports[p]->portType = t;
}

void esp8266ArtNetRDM::setMerge(uint8_t g, uint8_t p, bool htp) {
  if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
    return;
  _art->group[g]->ports[p]->mergeHTP = htp;
}

bool esp8266ArtNetRDM::getMerge(uint8_t g, uint8_t p) {
  if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
    return 0;
  return _art->group[g]->ports[p]->mergeHTP;
}



void esp8266ArtNetRDM::setShortName(char* name) {
  if (_art == 0)
    return;
  memcpy(_art->shortName, name, ARTNET_SHORT_NAME_LENGTH);
}

char* esp8266ArtNetRDM::getShortName() {
  if (_art == 0)
    return NULL;
  return _art->shortName;
}


void esp8266ArtNetRDM::setLongName(char* name) {
  if (_art == 0)
    return;
  memcpy(_art->longName, name, ARTNET_LONG_NAME_LENGTH);
}

char* esp8266ArtNetRDM::getLongName() {
  if (_art == 0)
    return NULL;
  return _art->longName;
}

void esp8266ArtNetRDM::setNodeReport(char* c, uint16_t code) {
  if (_art == 0)
    return;

  strlcpy(_art->nodeReport, c, ARTNET_NODE_REPORT_LENGTH);
  _art->nodeReportCode = code;
}

void esp8266ArtNetRDM::sendDMX(uint8_t g, uint8_t p, IPAddress bcAddress, uint8_t* data, uint16_t length) {
  if (_art == 0 || _art->numGroups <= g || _art->group[g]->ports[p] == 0)
    return;

  uint8_t net = _art->group[g]->netSwitch;
  uint8_t subnet = _art->group[g]->subnet;
  uint8_t uni = _art->group[g]->ports[p]->portUni;

  // length is always even and up to 512 channels
  if (length % 2)
    length += 1;
  if (length > 512)
    length = 512;

  _art->group[g]->ports[p]->dmxChans = length;

  unsigned char _artDMX[ARTNET_BUFFER_MAX];
  _artDMX[0] = 'A';
  _artDMX[1] = 'r';
  _artDMX[2] = 't';
  _artDMX[3] = '-';
  _artDMX[4] = 'N';
  _artDMX[5] = 'e';
  _artDMX[6] = 't';
  _artDMX[7] = 0;
  _artDMX[8] = ARTNET_ARTDMX;      	// op code lo-hi
  _artDMX[9] = ARTNET_ARTDMX >> 8;	
  _artDMX[10] = 0;  		   	// protocol version (14)
  _artDMX[11] = 14;
  _artDMX[12] = _dmxSeqID++;		// sequence ID
  _artDMX[13] = p;		   	// Port ID (not really necessary)
  _artDMX[14] = (subnet << 4) | uni;	// Subuni
  _artDMX[15] = (net & 0x7F);		// Netswitch
  _artDMX[16] = (length >> 8);		// DMX Data length
  _artDMX[17] = (length & 0xFF);

